#define _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include <locale.h>
using namespace std;

class Ведомость {
public:
    char type[100];
    int number;
    float lenght;
   short int time;
    void Show() {
        printf("%s          |\t  %c        |\t  %.2f         |\t  %d\n", type, number, lenght, time);
        printf("|---------------------------------------------------------------------------------|\n");
    }
    void Set() {
        printf("Введiть вид, №маршруту, протяжність маршруту, час у дорозі: ");
        scanf("%s %c %f %hd", &type, &number, &lenght, &time);
    }
};

int main() {
    setlocale(LC_ALL, "Rus");
    int size;
    cout << "Кількість відомостей: "; cin >> size;
    Ведомость* a = new Ведомость[size];
    for (int i = 0; i < size; i++) {
        a[i].Set();
    }
    printf("|---------------------------------------------------------------------------------|\n");
    printf("Відомість громадського транспорту   \n");
    printf("|---------------------------------------------------------------------------------|\n");
    printf("Вид транспорту|№ маршруту  |Протяжність маршруту | Час у дорозі\n");
    printf("|---------------------------------------------------------------------------------|\n");
    for (int i = 0; i < size; i++) {
        a[i].Show();
    }
    printf("Примітка: Тр – трамвай, Тс – тролейбус, А – автобус\n");
    printf("|---------------------------------------------------------------------------------|\n");
}