#include <iostream>

using namespace std;

int main()
{
    setlocale(LC_ALL, "");
    string message = "--------------------------------------------------------------------\n";
    message += "|Відомість громадського транспорту                                   |\n";
    message += "--------------------------------------------------------------------\n";
    message += "|Вид транспорту|№ маршруту |Протяжність маршруту | Час у дорозі      |\n";
    message += "--------------------------------------------------------------------\n";
    message += "|Тр            |12          |27.55                | 75               |\n";
    message += "--------------------------------------------------------------------\n";
    message += "|Т-с           |17          |13.6                 | 57               |\n";
    message += "--------------------------------------------------------------------\n";
    message += "|А             |12а         |57.3                 | 117              |\n";
    message += "--------------------------------------------------------------------\n";
    message += "|Примітка: Тр – трамвай, Тс – тролейбус, А – автобус                 |\n";
    message += "--------------------------------------------------------------------";
    cout << message;
}